//Задача №2


// Console.Clear();
// Console.WriteLine("Введите первое число");
// int number1 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите второе число");
// int number2 = Convert.ToInt32(Console.ReadLine());

// Console.Clear();


// if(number1 > number2)
// {
//     Console.WriteLine("Наибольшее число:");
//     Console.WriteLine(number1);
//     Console.WriteLine("Наименьшее число:");
//     Console.WriteLine(number2);
// }
// if(number1 < number2)
// {
//     Console.WriteLine("Наибольшее число:");
//     Console.WriteLine(number2);
//     Console.WriteLine("Наименьшее число:");
//     Console.WriteLine(number1);
// }
// else
// {
//     Console.WriteLine("Эти числа равны");
// }




// Задача №4


// Console.Clear();
// Console.WriteLine("Введите первое число");
// int number1 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите второе число");
// int number2 = Convert.ToInt32(Console.ReadLine());

// Console.WriteLine("Введите третье число");
// int number3 = Convert.ToInt32(Console.ReadLine());

// int[] i = { number1, number2, number3 };
// int max = i.Max(); //Подсмотрел данные две строчки в интернете

// Console.Clear();
// Console.WriteLine("Максимальное число:");
// Console.WriteLine(max);



//Задача №6


// Console.Clear();
// Console.WriteLine("Введите число");
// int number = Convert.ToInt32(Console.ReadLine());

// if(number % 2==0)
// {
//     Console.WriteLine("Число чётное");
// }
// else
// {
//     Console.WriteLine("Число нечётное");
// }




// Задача №8


// Console.Clear();
// Console.WriteLine("Введите число");
// int number = Convert.ToInt32(Console.ReadLine());
// Console.Clear();
// Console.WriteLine("Чётные числа:");
// while(0 < number)
// {
//     if(number % 2==0)
//     {

//         Console.WriteLine(number);
        
//     }
//     number--;
// }
