// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1



// int number = new Random().Next(100, 1000);
// Console.WriteLine("Изначальное число:");
// Console.WriteLine(number);

// int result = (number % 100)/10;


// Console.WriteLine("Вторая цифра:");
// Console.WriteLine(result);



// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// int number = new Random().Next(1, 10001);
// Console.Clear(); 
// Console.WriteLine("Изначальное число:");
// Console.WriteLine(number);
// int result = (number % 100)/10;

// if(result > 0)
// {
//     Console.WriteLine("Третья цифра:");
//     Console.WriteLine(result);
// }
// else
// {
//     Console.WriteLine("Третьей цифры нет");
// }

// Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, 
// является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет


// int number = new Random().Next(1, 8);

// Console.WriteLine(number);

// if(number == 6 || number == 7)
// {
//     Console.WriteLine("День недели под данной цифрой является выходным");
// }
// else
// {
//     Console.WriteLine("День недели под данной цифрой не является выходным");
// }
